""" Задача 34:
    Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. 
    Поскольку разобраться в его кричалках не настолько просто, 
    насколько легко он их придумывает, Вам стоит написать программу. 
    Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) 
    в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, 
    если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг от друга пробелами. 
    Стихотворение  Винни-Пух вбивает в программу с клавиатуры. 
    В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке

*Пример:*

**Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да    
    **Вывод:** Парам пам-пам   
"""
#ввод кричалок и прочих стихов
enteredString = input("Напишите кричалку для проверки рифмы \n(слова одной фразы отделяте дефисами '-', а фразы разделяте пробелом ' ')\n:")

#гласные для проверки ритма 
vowels = ['а','е','ё','и','о','у','ы','э','ю','я']

def chekRhythm(stringPoem):
    rhythm = False
    resaltStrings = stringPoem.split()
    for i in range(0, len(resaltStrings)):
        #подсчёт гласных для последующей проверки их чётности
        countVowels = 0
        for j in range(0, len(vowels)):
            countVowels = countVowels + resaltStrings[i].count(vowels[j])
        if (countVowels % 2 == 0):
            rhythm = True
        #отсутствие гласных или их нечётное количество приравнивается к отсутствию ритма
        elif (countVowels == 0):
            rhythm = False
            break
        else:
            rhythm = False
            break
    return rhythm

#вывод реплики по результату проверки ритма    
if (chekRhythm(enteredString) == False):
    print ("Пам парам")
else:
    print ("Парам пам-пам")

